### READ ME

Use the code blocks below to answer each quiz question. Only print the output required for each question. Do not edit the comments at the top of each code cell. Otherwise, the auto-grader may misinterpret your results. See Question 0 as an an example of how to complete a task (leave it in your notebook; don't delete it):

In [10]:
# Question 0: Create a DataFrame with three rows and four columns. Name the 
# columns 'Col1', 'Col2', 'Col3', 'Col4'. Create an index for the DataFrame
# and give the rows the index values of 'Row1', 'Row2', 'Row3'. Place a value
# in each column equal to the {ColumnName/RowName}. e.g. Col1/Row1. Print
# the entire DataFrame.

import pandas as pd

df = pd.DataFrame(columns=['Col1', 'Col2', 'Col3', 'Col4'], index=['Row1', 'Row2', 'Row3'])

for col in df:
  for i, value in df[col].items():
    df.at[i, col] = f'{i}/{col}'

df
# this is a test version two

           Col1       Col2       Col3       Col4
Row1  Row1/Col1  Row1/Col2  Row1/Col3  Row1/Col4
Row2  Row2/Col1  Row2/Col2  Row2/Col3  Row2/Col4
Row3  Row3/Col1  Row3/Col2  Row3/Col3  Row3/Col4

In [11]:
from operator import index
# Question 1: 
# 1. Create a new DataFrame named "df" out of the following actual crime data from 2015:
#    NOTE: There are many ways you can do this. for example:
#          a. First add the data and headers to a dictionary and then build a DataFrame from the dictionary
#          b. Create the DataFrame with column names, then set the index, then add the data row-by-row.Â 
#          Several others
#    Choose any method you want that works. However, some valid techniques are much harder/easier than others. 
#    Try to think of the easiest way to accomplish this task

# agency_code	location	population	homocides	assaults	robberies
# UT01803	Salt Lake City, UT	191992	8	874	469
# TXSPD00	San Antonio, TX	1463586	94	5465	1986
# CA03711	San Diego, CA	1400467	37	3601	1378
# MOSPD00	St. Louis, MO	317095	188	3521	1790
# NY05101	Suffolk County, NY	1341453	24	895	677

# 2. Set the agency_code as the index
# 3. Output the first 2 records in the "nice looking" Pandas DataFrame format (i.e. not the default print() format)

import pandas as pd
df = pd.DataFrame(columns=['agency_code', 'location', 'population', 'homocides', 'assaults', 'robberies'])
df.set_index('agency_code', inplace=True)

df.loc['UT01803'] = ["Salt Lake City, UT",	191992,	8,	874,	469]
df.loc['TXSPD00'] = ["San Antonio, TX",	1463586,	94,	5465,	1986]
df.loc['CA03711'] = ["San Diego, CA",	1400467,	37,	3601,	1378]
df.loc['MOSPD00'] = ["St. Louis, MO",	317095,	188,	3521,	1790]
df.loc['NY05101'] = ["Suffolk County, NY",	1341453,	24,	895,	677]

df

                       location population homocides assaults robberies
agency_code
UT01803      Salt Lake City, UT     191992         8      874       469
TXSPD00         San Antonio, TX    1463586        94     5465      1986
CA03711           San Diego, CA    1400467        37     3601      1378
MOSPD00           St. Louis, MO     317095       188     3521      1790
NY05101      Suffolk County, NY    1341453        24      895       677

In [12]:
# Question 2

# 1. Print just the location column
# 2. Print the entire row representing Salt Lake City's dataÂ using the .loc[] property
# 3. Print each of the columnÂ names/headers one-at-a-time

print(df.location)
print('')
print(df.loc['UT01803'])
print('')
for col in df:
    print(str(col))

agency_code
UT01803    Salt Lake City, UT
TXSPD00       San Antonio, TX
CA03711         San Diego, CA
MOSPD00         St. Louis, MO
NY05101    Suffolk County, NY
Name: location, dtype: object

location      Salt Lake City, UT
population                191992
homocides                      8
assaults                     874
robberies                    469
Name: UT01803, dtype: object

location
population
homocides
assaults
robberies

In [13]:
# Question 3

# 1. Add a new record for:
#       FL02902, Tampa, FL,Â 364383, 27, 2730, 733
# 2. Create a new DataFrame that includes the homocides per capita for each location. Call the DataFrame "df2" and name the column "homocides_per_capita"
#       This is calculated as (homocides / population) * 100000
#       You can use a calculator to generate these numbers and hard-code them into a DataFrame
# 3. Combine that new DataFrame with the prior existing DataFrame
#       This could be done in multiple ways. Take your pick. The new DataFrame should still be called "df"
# 4. Print the entire combined DataFrame in Pandas format (i.e. not using print())
# 
# NOTE: an easier way to accomplish the same task would be to create a new, calculated column in the 
# existing DataFrame. But that is not what is being tested here. So perform the steps as described above.

# 1. Add a new record for Florida's data
df.loc['FL02902'] = ["Tampa, FL", 364383, 27, 2730,	733]

# 2. Create a new DataFrame that includes the homocides per capita for each location. Call the DataFrame "df2" and name the column "homocides_per_capita"
df2 = pd.DataFrame(columns=['homocides_per_capita'])
df2['homocides_per_capita'] = (df.homocides / df.population) * 100000

#  3. Combine that new DataFrame with the prior existing DataFrame
df = pd.merge(df, df2, how='left', on='agency_code')

# 4. Print the entire combined DataFrame in Pandas format (i.e. not using print())
df

,location,population,homocides,assaults,robberies,homocides_per_capita
agency_code,,,,,,
UT01803,"Salt Lake City, UT",191992,8,874,469,4.16684
TXSPD00,"San Antonio, TX",1463586,94,5465,1986,6.42258
CA03711,"San Diego, CA",1400467,37,3601,1378,2.64198
MOSPD00,"St. Louis, MO",317095,188,3521,1790,59.2882
NY05101,"Suffolk County, NY",1341453,24,895,677,1.7891
FL02902,"Tampa, FL",364383,27,2730,733,7.40979

In [ ]:
# Question 4

# 1. Create a new calculated field in "df" called "total_crimes"
# 2. Fill this column with the sum of homocides, assaults, and robberies
# 3. Print the last three records of the DataFrame without using the print() statement

In [ ]:
# Question 5

# 1. Relabel any total_crimes value greater than, or equal to, 2,500 as 'high'
# 2. Relabel any total_crimes value lower than 2,500 as 'low' (HINT: This is a bit tricky because the population column is converted to an object/string after relabeling values >= 1000000 to 'high'. But the solution is very simple.)
# 3. Print out the middle 4 records of the DataFrame

In [ ]:
# Question 6

# 1. Iterate through the rows of df
# 2. For every count of assualtsÂ and robberies, print it out along with the agency code and add an additional flag "***" if the count per capita ((count / population) * 100000) is greater than 500 for assaults or 250 for robberies.

In [ ]:
# Question 7

# 1. Sort the DataFrame by homicides per capita from greatest to least on the original DataFrame (not a copy)
# 2. Filter/reduce the DataFrame down to only those with more than 50 total homocides ORÂ (not 'and') over 5000 assaults
# 3. Print the DataFrame